# RoomOccupancy Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RoomOccupancy Property
ParameterTypeId Class See Also
---
"Occupancy"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RoomOccupancy { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RoomOccupancy As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RoomOccupancy {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace